{"id": "sigil_clerks_ward", "name": "Sigil Clerks Ward", "roll": ["About 10 magical tomes start flying through the air with a distressed librarian running after them.", "A gnome mage gives a magical performance, which goes horribly wrong (illusion turns real).", "A girl cries about her missing dog.", "A bard offers to sing a ballad for the PCs.", "Signers recruiter.", "A man/woman who claims to be innocent begs the PCs for help. He/she is chased by the Harmonium.", "Random Baatezu (Default Kyton).", "Lamp boys.", "A troupe of actors ask the PCs to join them in their next performance to earn a bit of coin.", "A noble’s sedan procession.", "Random Tanari (Default Vrock).", "A Taker asks the PCs for all their money, claiming it is his right. He is insistent but avoids combat.", "Sensate recruiter.", "A group of 3 advocates rushing to the City Court.", "A person inviting the PCs to one of the shops.", "A Signer attempts to “will” the PCs out of existence.", "Large house for sale (20,000)", "3 Abishai plotting to invade Waterdeep and attack farms.", "A lecturer on the Lower Planes (probably a yugoloth) rushing to the Festhall.", "Poet battle!", "Harmonium patrol: 2+1D4 harmoniums", "A public debate.", "Fire! Fire!", "Fated recruiter.", "Roll random encounter in random ward.", "A wizard begs the PCs to help him release his bond with a demon.", "A small girl selling bronze flowers from Mechanus.", "A lost petitioner.", "Random Angel (Default Deva).", "One of the harlots from the Brothel of Slating Intellectual Lusts.", "Dabus.", "A druid examines some razorvine and shakes his head.", "2 Clerks walking to their office.", "A group of 3 sensates asks the PCs to let them experience something new.", "The PCs notice a trail of blood that leads into an alley.", "Harmonium patrol: 2+1D4 harmoniums", "A portal opens and something random appears (a giant slug!), causing havoc.", "A figure in a dark cloak asks the PCs to deliver a letter to Factol Erin Darkflame Montgomery.", "A man attempts to get the PCs to worship the Lady."]}