{
  "id": "sigil_guid_market_ward",
  "name": "Sigil Guid Market Ward",
  "roll": [
    "Rats! A group of 1D6 (min.2) swarms of cranium rats burst out from one of the nearby buildings/stalls.",
    "Dabus.",
    "Random Angel (Default Deva).",
    "A man shouting the latest offers.",
    "A dead ox causes a gridlock.",
    "A man/woman asks the PCs for directions.",
    "A merchant tries to sell the PCs a worthless trinket.",
    "A drinking contest between two planar creatures.",
    "Transcendent Order recruiter.",
    "Merchant in a heated argument with a customer, with someone picking his/her pocket.",
    "A customer pulls a weapon on a merchant.",
    "Random Baatezu (Default Kyton).",
    "A thieft leaps over a cart and 2 harmonium run after him, toppling it. Merchant screams at them.",
    "Pickpocket!",
    "A merchant chasing a thief.",
    "Someone asks the PCs for help in distributing flyers.",
    "Random Tanari (Default Vrock).",
    "2 Harmonium soldiers on patrol.",
    "A group of Githyanki selling their loot from their latest raid.",
    "A Harmonium chasing a debtor.",
    "A slave trader offers to buy the PCs from one of the PCs.",
    "Indep recruiter.",
    "House for sale (10,000 gp).",
    "A customer argues with a merchant while someone steals something from his/her stall.",
    "Roll random encounter in random ward.",
    "Mercykillers arresting a merchant.",
    "2 Harmonium soldiers on patrol.",
    "Merchant in a heated argument with a customer.",
    "A smug-looking elf tries to sell PCs a portal key to a portal in Lady’s Ward (fake), 100 GP.",
    "The PCs see a wizard banish a genie back into a bottle.",
    "3+1D4 Mindflayers and their (1D4) 1: Human 2: Dwarven 3: Elven 4: Halfling Slaves, from the Prime.",
    "Two Ciphers having a martial battle with crowds watching. They are a blur.",
    "Lamp boys.",
    "A pair of Ciphers going to the Great Gymnasium.",
    "A lost petitioner.",
    "Fell, looking for components.",
    "A harlot.",
    "A candlemaker with a cart full of candles. It moves as it passes the PCs.",
    "A Beholder shopping for something. People give him a wide berth."
  ]
}